const TEST_DATA = [
    {
        "category": "КРОК 1",
        "items": [
            {
                "subject": "Фізична терапія, ерготерапія",
                "subCategory": "",
                "fileName": "КРОК 1 Фізична терапія, ерготерапія.pdf",
                "path": "КРОК 1/Фізична терапія, ерготерапія/PDF/КРОК 1 Фізична терапія, ерготерапія.pdf",
                "questions": 150
            },
            {
                "subject": "Фармація",
                "subCategory": "",
                "fileName": "КРОК 1 Фармація.pdf",
                "path": "КРОК 1/Фармація/PDF/КРОК 1 Фармація.pdf",
                "questions": 868
            },
            {
                "subject": "Стоматологія",
                "subCategory": "",
                "fileName": "КРОК 1 Стоматологія.pdf",
                "path": "КРОК 1/Стоматологія/PDF/КРОК 1 Стоматологія.pdf",
                "questions": 984
            },
            {
                "subject": "Медицина",
                "subCategory": "",
                "fileName": "КРОК 1 Медицина.pdf",
                "path": "КРОК 1/Медицина/PDF/КРОК 1 Медицина.pdf",
                "questions": 2750
            },
            {
                "subject": "Педіатрія",
                "subCategory": "",
                "fileName": "КРОК 1 Педіатрія.pdf",
                "path": "КРОК 1/Педіатрія/PDF/КРОК 1 Педіатрія.pdf",
                "questions": 111
            }
        ]
    },
    {
        "category": "КРОК 2",
        "items": [
            {
                "subject": "Ерготерапія",
                "subCategory": "",
                "fileName": "КРОК 2 Ерготерапія.pdf",
                "path": "КРОК 2/Ерготерапія/PDF/КРОК 2 Ерготерапія.pdf",
                "questions": 251
            },
            {
                "subject": "Фармація",
                "subCategory": "",
                "fileName": "КРОК 2 Фармація.pdf",
                "path": "КРОК 2/Фармація/PDF/КРОК 2 Фармація.pdf",
                "questions": 1348
            },
            {
                "subject": "Стоматологія",
                "subCategory": "",
                "fileName": "КРОК 2 Стоматологія.pdf",
                "path": "КРОК 2/Стоматологія/PDF/КРОК 2 Стоматологія.pdf",
                "questions": 1453
            },
            {
                "subject": "Медицина",
                "subCategory": "",
                "fileName": "КРОК 2 Медицина.pdf",
                "path": "КРОК 2/Медицина/PDF/КРОК 2 Медицина.pdf",
                "questions": 2626
            },
            {
                "subject": "Педіатрія",
                "subCategory": "",
                "fileName": "КРОК 2 Педіатрія.pdf",
                "path": "КРОК 2/Педіатрія/PDF/КРОК 2 Педіатрія.pdf",
                "questions": 148
            },
            {
                "subject": "Фізична терапія",
                "subCategory": "",
                "fileName": "КРОК 2 Фізична терапія.pdf",
                "path": "КРОК 2/Фізична терапія/PDF/КРОК 2 Фізична терапія.pdf",
                "questions": 452
            },
            {
                "subject": "Клінічна фармація",
                "subCategory": "",
                "fileName": "КРОК 2 Клінічна фармація.pdf",
                "path": "КРОК 2/Клінічна фармація/PDF/КРОК 2 Клінічна фармація.pdf",
                "questions": 359
            },
            {
                "subject": "Технологія парфумерно-косметичних засобів",
                "subCategory": "",
                "fileName": "КРОК 2 Технологія парфумерно-косметичних засобів.pdf",
                "path": "КРОК 2/Технологія парфумерно-косметичних засобів/PDF/КРОК 2 Технологія парфумерно-косметичних засобів.pdf",
                "questions": 361
            },
            {
                "subject": "Медична психологія",
                "subCategory": "",
                "fileName": "КРОК 2 Медична психологія.pdf",
                "path": "КРОК 2/Медична психологія/PDF/КРОК 2 Медична психологія.pdf",
                "questions": 723
            }
        ]
    },
    {
        "category": "КРОК 3",
        "items": [
            {
                "subject": "Фармація",
                "subCategory": "",
                "fileName": "КРОК 3 Фармація.pdf",
                "path": "КРОК 3/Фармація/PDF/КРОК 3 Фармація.pdf",
                "questions": 441
            },
            {
                "subject": "Стоматологія",
                "subCategory": "",
                "fileName": "КРОК 3 Стоматологія.pdf",
                "path": "КРОК 3/Стоматологія/PDF/КРОК 3 Стоматологія.pdf",
                "questions": 2460
            },
            {
                "subject": "Психіатрія",
                "subCategory": "",
                "fileName": "КРОК 3 Психіатрія.pdf",
                "path": "КРОК 3/Психіатрія/PDF/КРОК 3 Психіатрія.pdf",
                "questions": 273
            },
            {
                "subject": "Хірургія",
                "subCategory": "",
                "fileName": "КРОК 3 Хірургія.pdf",
                "path": "КРОК 3/Хірургія/PDF/КРОК 3 Хірургія.pdf",
                "questions": 150
            },
            {
                "subject": "Внутрішні хвороби",
                "subCategory": "",
                "fileName": "КРОК 3 Внутрішні хвороби.pdf",
                "path": "КРОК 3/Внутрішні хвороби/PDF/КРОК 3 Внутрішні хвороби.pdf",
                "questions": 293
            },
            {
                "subject": "Інфекційні хвороби",
                "subCategory": "",
                "fileName": "КРОК 3 Інфекційні хвороби.pdf",
                "path": "КРОК 3/Інфекційні хвороби/PDF/КРОК 3 Інфекційні хвороби.pdf",
                "questions": 297
            },
            {
                "subject": "Педіатрія",
                "subCategory": "",
                "fileName": "КРОК 3 Педіатрія.pdf",
                "path": "КРОК 3/Педіатрія/PDF/КРОК 3 Педіатрія.pdf",
                "questions": 291
            },
            {
                "subject": "Фізична та реабілітаційна медицина (ФРМ)",
                "subCategory": "",
                "fileName": "КРОК 3 Фізична та реабілітаційна медицина (ФРМ).pdf",
                "path": "КРОК 3/Фізична та реабілітаційна медицина (ФРМ)/PDF/КРОК 3 Фізична та реабілітаційна медицина (ФРМ).pdf",
                "questions": 289
            },
            {
                "subject": "Офтальмологія",
                "subCategory": "",
                "fileName": "КРОК 3 Офтальмологія.pdf",
                "path": "КРОК 3/Офтальмологія/PDF/КРОК 3 Офтальмологія.pdf",
                "questions": 271
            },
            {
                "subject": "Епідеміологія",
                "subCategory": "",
                "fileName": "КРОК 3 Епідеміологія.pdf",
                "path": "КРОК 3/Епідеміологія/PDF/КРОК 3 Епідеміологія.pdf",
                "questions": 276
            },
            {
                "subject": "Радіологія",
                "subCategory": "",
                "fileName": "КРОК 3 Радіологія.pdf",
                "path": "КРОК 3/Радіологія/PDF/КРОК 3 Радіологія.pdf",
                "questions": 261
            },
            {
                "subject": "Дерматовенерологія",
                "subCategory": "",
                "fileName": "КРОК 3 Дерматовенерологія.pdf",
                "path": "КРОК 3/Дерматовенерологія/PDF/КРОК 3 Дерматовенерологія.pdf",
                "questions": 305
            },
            {
                "subject": "Загальна практика-сімейна медицина",
                "subCategory": "",
                "fileName": "КРОК 3 Загальна практика-сімейна медицина.pdf",
                "path": "КРОК 3/Загальна практика-сімейна медицина/PDF/КРОК 3 Загальна практика-сімейна медицина.pdf",
                "questions": 283
            },
            {
                "subject": "Патологічна анатомія",
                "subCategory": "",
                "fileName": "КРОК 3 Патологічна анатомія.pdf",
                "path": "КРОК 3/Патологічна анатомія/PDF/КРОК 3 Патологічна анатомія.pdf",
                "questions": 397
            },
            {
                "subject": "Неврологія",
                "subCategory": "",
                "fileName": "КРОК 3 Неврологія.pdf",
                "path": "КРОК 3/Неврологія/PDF/КРОК 3 Неврологія.pdf",
                "questions": 273
            },
            {
                "subject": "Лабораторна діагностика",
                "subCategory": "",
                "fileName": "КРОК 3 Лабораторна діагностика.pdf",
                "path": "КРОК 3/Лабораторна діагностика/PDF/КРОК 3 Лабораторна діагностика.pdf",
                "questions": 1124
            },
            {
                "subject": "Медицина невідкладних станів",
                "subCategory": "",
                "fileName": "КРОК 3 Медицина невідкладних станів.pdf",
                "path": "КРОК 3/Медицина невідкладних станів/PDF/КРОК 3 Медицина невідкладних станів.pdf",
                "questions": 263
            },
            {
                "subject": "Загальна лікарська підготовка",
                "subCategory": "",
                "fileName": "КРОК 3 Загальна лікарська підготовка.pdf",
                "path": "КРОК 3/Загальна лікарська підготовка/PDF/КРОК 3 Загальна лікарська підготовка.pdf",
                "questions": 2006
            },
            {
                "subject": "Медична психологія",
                "subCategory": "",
                "fileName": "КРОК 3 Медична психологія.pdf",
                "path": "КРОК 3/Медична психологія/PDF/КРОК 3 Медична психологія.pdf",
                "questions": 150
            }
        ]
    },
    {
        "category": "ЄДКІ",
        "items": [
            {
                "subject": "Медсестринство",
                "subCategory": "ЄДКІ Бакалаври",
                "fileName": "ЄДКІ Бакалаври Медсестринство.pdf",
                "path": "ЄДКІ/ЄДКІ Бакалаври/Медсестринство/PDF/ЄДКІ Бакалаври Медсестринство.pdf",
                "questions": 300
            },
            {
                "subject": "Лабораторна діагностика",
                "subCategory": "ЄДКІ Бакалаври",
                "fileName": "ЄДКІ Бакалаври Лабораторна діагностика.pdf",
                "path": "ЄДКІ/ЄДКІ Бакалаври/Лабораторна діагностика/PDF/ЄДКІ Бакалаври Лабораторна діагностика.pdf",
                "questions": 805
            },
            {
                "subject": "Сестринська справа",
                "subCategory": "ЄДКІ Бакалаври",
                "fileName": "ЄДКІ Бакалаври Сестринська справа.pdf",
                "path": "ЄДКІ/ЄДКІ Бакалаври/Сестринська справа/PDF/ЄДКІ Бакалаври Сестринська справа.pdf",
                "questions": 715
            },
            {
                "subject": "Лікувальна справа",
                "subCategory": "ЄДКІ Фахова передвища освіта",
                "fileName": "ЄДКІ Фахова передвища освіта Лікувальна справа.pdf",
                "path": "ЄДКІ/ЄДКІ Фахова передвища освіта/Лікувальна справа/PDF/ЄДКІ Фахова передвища освіта Лікувальна справа.pdf",
                "questions": 1600
            },
            {
                "subject": "Медико-профілактична справа",
                "subCategory": "ЄДКІ Фахова передвища освіта",
                "fileName": "ЄДКІ Фахова передвища освіта Медико-профілактична справа.pdf",
                "path": "ЄДКІ/ЄДКІ Фахова передвища освіта/Медико-профілактична справа/PDF/ЄДКІ Фахова передвища освіта Медико-профілактична справа.pdf",
                "questions": 635
            },
            {
                "subject": "Стоматологія ортопедична",
                "subCategory": "ЄДКІ Фахова передвища освіта",
                "fileName": "ЄДКІ Фахова передвища освіта Стоматологія ортопедична.pdf",
                "path": "ЄДКІ/ЄДКІ Фахова передвища освіта/Стоматологія ортопедична/PDF/ЄДКІ Фахова передвища освіта Стоматологія ортопедична.pdf",
                "questions": 379
            },
            {
                "subject": "Лабораторна діагностика",
                "subCategory": "ЄДКІ Фахова передвища освіта",
                "fileName": "ЄДКІ Фахова передвища освіта Лабораторна діагностика.pdf",
                "path": "ЄДКІ/ЄДКІ Фахова передвища освіта/Лабораторна діагностика/PDF/ЄДКІ Фахова передвища освіта Лабораторна діагностика.pdf",
                "questions": 613
            },
            {
                "subject": "Сестринська справа",
                "subCategory": "ЄДКІ Фахова передвища освіта",
                "fileName": "ЄДКІ Фахова передвища освіта Сестринська справа.pdf",
                "path": "ЄДКІ/ЄДКІ Фахова передвища освіта/Сестринська справа/PDF/ЄДКІ Фахова передвища освіта Сестринська справа.pdf",
                "questions": 944
            },
            {
                "subject": "Фармація, промислова фармація",
                "subCategory": "ЄДКІ Фахова передвища освіта",
                "fileName": "ЄДКІ Фахова передвища освіта Фармація, промислова фармація.pdf",
                "path": "ЄДКІ/ЄДКІ Фахова передвища освіта/Фармація, промислова фармація/PDF/ЄДКІ Фахова передвища освіта Фармація, промислова фармація.pdf",
                "questions": 412
            },
            {
                "subject": "Акушерська справа",
                "subCategory": "ЄДКІ Фахова передвища освіта",
                "fileName": "ЄДКІ Фахова передвища освіта Акушерська справа.pdf",
                "path": "ЄДКІ/ЄДКІ Фахова передвища освіта/Акушерська справа/PDF/ЄДКІ Фахова передвища освіта Акушерська справа.pdf",
                "questions": 861
            }
        ]
    }
];